In [3]:
import pandas as pd

# Generalizing split-apply-combine with apply()

In [4]:
titanic = pd.read_csv("../../Data/titanic.csv", usecols=["survived", "pclass", "sex", "age"])

In [6]:
titanic

     survived  pclass     sex   age
0           0       3    male  22.0
1           1       1  female  38.0
2           1       3  female  26.0
3           1       1  female  35.0
4           0       3    male  35.0
..        ...     ...     ...   ...
886         0       2    male  27.0
887         1       1  female  19.0
888         0       3  female   NaN
889         1       1    male  26.0
890         0       3    male  32.0

[891 rows x 4 columns]

# We while old 5 passengers. We can use the apply() method to generalize the nlargest() method to find the oldest 5 passengers in each group.

In [7]:
titanic.groupby(by='sex').apply(lambda x: x.nlargest(5, 'age'))

C:\Users\Darius\AppData\Local\Temp\ipykernel_1972\2388191981.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  titanic.groupby(by='sex').apply(lambda x: x.nlargest(5, 'age'))

            survived  pclass     sex   age
sex
female 275         1       1  female  63.0
       483         1       3  female  63.0
       829         1       1  female  62.0
       366         1       1  female  60.0
       11          1       1  female  58.0
male   630         1       1    male  80.0
       851         0       3    male  74.0
       96          0       1    male  71.0
       493         0       1    male  71.0
       116         0       3    male  70.5